Update diagram
